Aplicando as primeiras functions.

In [11]:
import pandas as pd
import numpy as np

Criando uma tabela com nomes e números de telefone.

In [13]:
dados = [
    ['Nome 1','4299999912'],
    ['Nome 2','4299999913'],
    ['Nome 3','4299999914'],
    ['Nome 4','4299999915'],
]

df=pd.DataFrame(dados,columns=["nome","telefone_completo"])

Criando arquivo em Excel com a tabela criada.

In [14]:
df.to_excel("dados.xlsx",index=False)

Ler o arquivo.

In [24]:
arquivo_lido=pd.read_excel("dados.xlsx")
arquivo_lido

     nome  telefone_completo   endereco
0     NaN                NaN        NaN
1     NaN                NaN        NaN
2  Nome 3       4.300000e+09      rua z
3  Nome 4       4.300000e+09  rua teste
4  Nome 5       4.300000e+09   rua nova
5  Nome 6       4.300000e+09    rua 123

Ler arquivo sem qualquer instância nula para o atributo nome e que a string nome tem '3'.

In [32]:
arquivo_lido.query("~nome.isna() and nome.str.contains('3')")

     nome  telefone_completo endereco
2  Nome 3       4.300000e+09    rua z